
class TaxSystem:
    """Система налогообложения"""

    COMMON = 0
    """Общая"""

    SIMPLIFIED_IN = 1
    """Упрощённая, доход"""

    SIMPLIFIED_IN_OUT = 2
    """Упрощённая, доход минус расход"""

    UTOII = 3
    """Единый налог на вменённый доход"""

    UST = 4
    """Единый сельскохозяйственный налог"""

    PATENT = 5
    """Патентная система налогообложения"""


class VatRate:
    """Налоговая ставка"""

    RATE_NO = 0
    """Без НДС"""

    RATE_0 = 1
    """НДС по ставке 0%"""

    RATE_10 = 2
    """НДС чека по ставке 10%"""

    RATE_20 = 6
    """НДС чека по ставке 20%"""

    RATE_110 = 4
    """НДС чека по расчетной ставке 10/110"""

    RATE_120 = 7
    """НДС чека по расчётной ставке 20/120"""


class PaymentMethod:
    """Тип оплаты"""

    FULL_PRE = 1
    """Полная предварительная оплата до момента передачи предмета расчёта"""

    PARTIAL_PRE = 2
    """Частичная предварительная оплата до момента передачи предмета расчёта"""

    PREPAID_EXPENSE = 3
    """Аванс"""

    FULL = 4
    """Полная оплата в момент передачи предмета расчёта"""

    PARTIAL_CREDIT = 5
    """
    Частичная оплата предмета расчёта в момент его передачи
    с последующей оплатой в кредит"""

    TRANSFER_CREDIT = 6
    """
    Передача предмета расчёта без его оплаты в момент его передачи
    с последующей оплатой в кредит"""

    TRANSFER_POST_CREDIT = 7
    """Оплата предмета расчёта после его передачи с оплатой в кредит"""


class PaymentObject:
    """ Тип оплачиваемой позиции """

    PRODUCT = 1
    """товар"""

    EXCISE_PRODUCT = 2
    """подакцизный товар"""

    JOB = 3
    """работа"""

    SERVICE = 4
    """услуга"""

    GAMBLING_RATE = 5
    """ставка азартной игры"""

    GAMBLING_GAIN = 6
    """выигрыш азартной игры"""

    LOTTERY_TICKET = 7
    """лотерейный билет"""

    LOTTERY_GAIN = 8
    """выигрыш лотереи"""

    RID = 9
    """предоставление РИД"""

    PAYMENT = 10
    """платёж"""

    AGENT_REWARD = 11
    """агентское вознаграждение"""

    COMPOSITE_OBJECT = 12
    """составной предмет расчёта"""

    OTHER_OBJECT = 13
    """иной предмет расчёта"""

    TITLE_PROPERTY = 14
    """имущественное право"""

    EXTRAORDINARY = 15
    """внереализационный доход"""

    INSURANCE_FEE = 16
    """
    страховые взносы: о суммах расходов,
    уменьшающих сумму налога (авансовых платежей)"""

    TRADE_FEE = 17
    """торговый сбор: о суммах уплаченного торгового сбора"""

    RESORT_FEE = 18
    """курортный сбор"""


class OrderStatus:
    """ Статус заказа """

    REGISTERED = 0
    """заказ зарегистрирован, но не оплачен;"""

    HOLD = 1
    """предавторизованная сумма удержана (для двухстадийных платежей)"""

    SUCCESS = 2
    """проведена полная авторизация суммы заказа"""

    CANCEL = 3
    """авторизация отменена"""

    RETURN = 4
    """по транзакции была проведена операция возврата"""

    INIT = 5
    """инициирована авторизация через сервер контроля доступа банка-эмитента"""

    DECLINED = 6
    """авторизация отклонена"""

    @classmethod
    def is_success(cls, status):
        if status in [cls.SUCCESS, cls.HOLD]:
            return True
        return False
